kyyang28/stm32f407disc_bldcmotor/src/quad/drivers/timer.c

#include <stdio.h>				// debugging purposes ONLY
#include <string.h>
#include "timer.h"
#include "utils.h"
#include "misc.h"
#include "nvic.h"
#include "atomic.h"
#include "stm32f4xx.h"

#define TIM_N(n) 					(1 << (n))

#define USED_TIMER_COUNT 			BITCOUNT(USED_TIMERS)			// defined in timer.h
#define CC_CHANNELS_PER_TIMER 		4              					// TIM_Channel_1..4

/*
 * TIM_IT_CCx(TIM_Channel_1): (TIM_IT_CC1 << ((ch) / 4)) ==> (TIM_IT_CC1 << ((TIM_Channel_1) / 4)) ==> (0x0002 << ((0x0000) / 4)) ==> 0x0002
 * TIM_IT_CCx(TIM_Channel_2): (TIM_IT_CC1 << ((ch) / 4)) ==> (TIM_IT_CC1 << ((TIM_Channel_2) / 4)) ==> (0x0002 << ((0x0004) / 4)) ==> 0x0004
 * TIM_IT_CCx(TIM_Channel_3): (TIM_IT_CC1 << ((ch) / 4)) ==> (TIM_IT_CC1 << ((TIM_Channel_3) / 4)) ==> (0x0002 << ((0x0008) / 4)) ==> 0x0008
 * TIM_IT_CCx(TIM_Channel_4): (TIM_IT_CC1 << ((ch) / 4)) ==> (TIM_IT_CC1 << ((TIM_Channel_4) / 4)) ==> (0x0002 << ((0x000C) / 4)) ==> 0x0010
 */
#define TIM_IT_CCx(ch)				(TIM_IT_CC1 << ((ch) / 4))		// TIM_IT_CC1: 0x0002

typedef struct timerConfig_s {
    timerCCHandlerRec_t *edgeCallback[CC_CHANNELS_PER_TIMER];
    timerOvrHandlerRec_t *overflowCallback[CC_CHANNELS_PER_TIMER];
    timerOvrHandlerRec_t *overflowCallbackActive; // null-terminated linkded list of active overflow callbacks
    uint32_t forcedOverflowTimerValue;
} timerConfig_t;
timerConfig_t timerConfig[USED_TIMER_COUNT];

typedef struct {
    channelType_t type;
} timerChannelInfo_t;
timerChannelInfo_t timerChannelInfo[USABLE_TIMER_CHANNEL_COUNT];

typedef struct {
    uint8_t priority;
} timerInfo_t;
timerInfo_t timerInfo[USED_TIMER_COUNT];

#define TIMER_INDEX(i)			BITCOUNT((TIM_N(i) - 1) & USED_TIMERS)

/* +----------------------------------------------------------------------------------+ */
/* +---------------------------- Testing user button (PA0) ---------------------------+ */
/* +----------------------------------------------------------------------------------+ */
/*
 * Status of Input Capture:
 * 		- [7]: 0: Capture unsuccessfully, 1: Capture successfully
 *		- [6]: 0: Low voltage level is not yet captured, 1: Low voltage level is captured successfully
 *		- [5:0]: The overflow counter after low voltage level has been captured (Based on the 32-bit timer, 1us increments 1, overflow time: 4294 seconds)
 */
//uint8_t TIM5_CH1_CAPTURE_STATUS = 0;			// Status of input capture
//uint32_t TIM5_CH1_CAPTURE_VAL;					// Value of input capture (TIM5 is 32bit timer)
/* +----------------------------------------------------------------------------------+ */
/* +---------------------------- Testing user button (PA0) ---------------------------+ */
/* +----------------------------------------------------------------------------------+ */

static uint8_t lookupTimerIndex(const TIM_TypeDef *tim)
{
#define _CASE_SHF	10		// amount we can safely shift timer address to the right. gcc will throw error if some timers overlap
#define _CASE_(tim, index)	case ((unsigned)tim >> _CASE_SHF): return index; break;
#define _CASE(i) _CASE_(TIM##i##_BASE, TIMER_INDEX(i))
	// TIM1_BASE
//	printf("TIM5_BASE: 0x%x, %s, %d\r\n", (uint32_t)TIM5_BASE, __FUNCTION__, __LINE__);		// TIM5_BASE: 0x40000C00
//	printf("tim: 0x%x, %s, %d\r\n", (uint32_t)tim, __FUNCTION__, __LINE__);					// tim: TIM5: 0x40000C00
//	printf("_CASE_SHF: %d, %s, %d\r\n", _CASE_SHF, __FUNCTION__, __LINE__);					// _CASE_SHF: 10
//	printf("TIM5_BASE >> _CASE_SHF: 0x%x, %s, %d\r\n", (uint32_t)TIM5_BASE >> _CASE_SHF, __FUNCTION__, __LINE__);	// TIM5_BASE >> _CASE_SHF: 0x100003
//	printf("tim >> _CASE_SHF: 0x%x, %s, %d\r\n", (unsigned)tim >> _CASE_SHF, __FUNCTION__, __LINE__);		// tim(TIM5) >> _CASE_SHF: 0x100003
//	printf("USED_TIMERS: 0x%x, %s, %d\r\n", USED_TIMERS, __FUNCTION__, __LINE__);

//	printf("(TIM_N(1) - 1): 0x%x, %s, %d\r\n", (TIM_N(1) - 1), __FUNCTION__, __LINE__);
//	printf("USED_TIMERS & TIM_N(1): 0x%x, %s, %d\r\n", USED_TIMERS & TIM_N(1), __FUNCTION__, __LINE__);
//	printf("(TIM_N(1) - 1) & USED_TIMERS: 0x%x, %s, %d\r\n", (TIM_N(1) - 1) & USED_TIMERS, __FUNCTION__, __LINE__);
//	printf("TIMER_INDEX(1): %d, %s, %d\r\n", TIMER_INDEX(1), __FUNCTION__, __LINE__);
//	printf("(TIM_N(2) - 1): 0x%x, %s, %d\r\n", (TIM_N(2) - 1), __FUNCTION__, __LINE__);
//	printf("(TIM_N(2) - 1) & USED_TIMERS: 0x%x, %s, %d\r\n", (TIM_N(2) - 1) & USED_TIMERS, __FUNCTION__, __LINE__);
//	printf("TIMER_INDEX(2): %d, %s, %d\r\n", TIMER_INDEX(2), __FUNCTION__, __LINE__);
//	printf("(TIM_N(3) - 1): 0x%x, %s, %d\r\n", (TIM_N(3) - 1), __FUNCTION__, __LINE__);
//	printf("(TIM_N(3) - 1) & USED_TIMERS: 0x%x, %s, %d\r\n", (TIM_N(3) - 1) & USED_TIMERS, __FUNCTION__, __LINE__);
//	printf("TIMER_INDEX(3): %d, %s, %d\r\n", TIMER_INDEX(3), __FUNCTION__, __LINE__);
//	printf("(TIM_N(5) - 1): 0x%x, %s, %d\r\n", (TIM_N(5) - 1), __FUNCTION__, __LINE__);		// (TIM_N(5) - 1) = 0x1f (31)
//	printf("(TIM_N(5) - 1) & USED_TIMERS: 0x%x, %s, %d\r\n", (TIM_N(5) - 1) & USED_TIMERS, __FUNCTION__, __LINE__);	// (TIM_N(5) - 1) & USED_TIMERS = 0x1e
//	printf("TIMER_INDEX(5): %d, %s, %d\r\n", TIMER_INDEX(5), __FUNCTION__, __LINE__);			// TIMER_INDEX(5) = 4
	
	/* let gcc do the work, switch should be quite optimised */
	switch ((unsigned)tim >> _CASE_SHF) {
#if USED_TIMERS & TIM_N(1)
		_CASE(1);
#endif
#if USED_TIMERS & TIM_N(2)
		_CASE(2);
#endif
#if USED_TIMERS & TIM_N(3)
		_CASE(3);
#endif
#if USED_TIMERS & TIM_N(4)
		_CASE(4);
#endif
#if USED_TIMERS & TIM_N(5)
		_CASE(5);
#endif
#if USED_TIMERS & TIM_N(6)
		_CASE(6);
#endif
#if USED_TIMERS & TIM_N(7)
		_CASE(7);
#endif
#if USED_TIMERS & TIM_N(8)
		_CASE(8);
#endif
#if USED_TIMERS & TIM_N(9)
		_CASE(9);
#endif
#if USED_TIMERS & TIM_N(10)
		_CASE(10);
#endif
#if USED_TIMERS & TIM_N(11)
		_CASE(11);
#endif
#if USED_TIMERS & TIM_N(12)
		_CASE(12);
#endif
#if USED_TIMERS & TIM_N(13)
		_CASE(13);
#endif
#if USED_TIMERS & TIM_N(14)
		_CASE(14);
#endif
#if USED_TIMERS & TIM_N(15)
		_CASE(15);
#endif
#if USED_TIMERS & TIM_N(16)
		_CASE(16);
#endif
#if USED_TIMERS & TIM_N(17)
		_CASE(17);
#endif
	default: return ~1;		// make sure final index is out of range
	}
#undef _CASE
#undef _CASE_
}

static inline uint8_t lookupChannelIndex(const uint16_t channel)
{
	/*
	 *	#define TIM_Channel_1                      ((uint16_t)0x0000)
	 *  #define TIM_Channel_2                      ((uint16_t)0x0004)
	 *	#define TIM_Channel_3                      ((uint16_t)0x0008)
	 *	#define TIM_Channel_4                      ((uint16_t)0x000C)
	 *
	 * channel = TIM_Channel_1 or TIM_Channel_2 or TIM_Channel_3 or TIM_Channel_4
	 * if channel == TIM_Channel_1
	 *		channel >> 2: TIM_Channel_1 >> 2: 0x0000 >> 2: 0x0
	 * 
	 * if channel == TIM_Channel_2
	 *		channel >> 2: TIM_Channel_2 >> 2: 0x0004 >> 2: 0x1
	 * 
	 * if channel == TIM_Channel_3
	 *		channel >> 2: TIM_Channel_3 >> 2: 0x0008 >> 2: 0x2
	 * 
	 * if channel == TIM_Channel_4
	 *		channel >> 2: TIM_Channel_4 >> 2: 0x000C >> 2: 0x3
	 *
	 * channelIndex:
	 *		- 0 corresponds to TIM_Channel_1
	 *		- 1 corresponds to TIM_Channel_2
	 *		- 2 corresponds to TIM_Channel_3
	 *		- 3 corresponds to TIM_Channel_4
 	 */
	return channel >> 2;
}

RccPeriphTag_t timerRCC(TIM_TypeDef *tim)
{
    for (int i = 0; i < HARDWARE_TIMER_DEFINITION_COUNT; i++) {
        if (timerDefinitions[i].TIMx == tim) {
            return timerDefinitions[i].rcc;
        }
    }
    return 0;
}

void timerForceOverflow(TIM_TypeDef *tim)
{
	uint8_t timerIndex = lookupTimerIndex((const TIM_TypeDef *)tim);
	
	/* 0x50 = NVIC_PRIO_TIMER defined in nvic.h */
	for ( uint8_t __ToDo = __basepriSetMemRetVal(0x50); __ToDo ; __ToDo = 0 ) {
		/* Save the current count so that PPM reading will work on the same timer that was forced to overflow */
		timerConfig[timerIndex].forcedOverflowTimerValue = tim->CNT + 1;
		
		/* Force an overflow by setting the UG bit */
		tim->EGR |= TIM_EGR_UG;
		__set_BASEPRI(0x00);		// reset basepri to 0x00, no mask for interrupt
	}
}

const timerHardware_t *timerGetByTag(ioTag_t tag, timerUsageFlag_e flag)
{
	if (!tag) {
		return NULL;
	}
	
	for (int i = 0; i < USABLE_TIMER_CHANNEL_COUNT; i++) {
		if (timerHardware[i].tag == tag) {
			if (timerHardware[i].usageFlags & flag || flag == 0) {
				return &timerHardware[i];
			}
		}
	}
	
