kyyang28/stm32f407disc_bldcmotor/src/quad/drivers/timer.c
	return NULL;
}

void configTimeBaseKhz(TIM_TypeDef *tim, uint16_t period, uint8_t khz)
{
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	
	TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
	TIM_TimeBaseStructure.TIM_Period = (period - 1) & 0xFFFF;		// AKA TIMx_ARR
	
	TIM_TimeBaseStructure.TIM_Prescaler = (SystemCoreClock / timerClockDivisor(tim) / ((uint32_t)khz * 1000)) - 1;
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit(tim, &TIM_TimeBaseStructure);
}

void configTimeBaseMhz(TIM_TypeDef *tim, uint16_t period, uint8_t Mhz)
{
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	
	TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
	TIM_TimeBaseStructure.TIM_Period = (period - 1) & 0xFFFF;		// AKA TIMx_ARR
//	printf("TIM_TimeBaseStructure.TIM_Period: %u, %s, %d\r\n", TIM_TimeBaseStructure.TIM_Period, __FUNCTION__, __LINE__);
	
	TIM_TimeBaseStructure.TIM_Prescaler = (SystemCoreClock / timerClockDivisor(tim) / ((uint32_t)Mhz * 1000000)) - 1;
//	printf("TIM_TimeBaseStructure.TIM_Prescaler: %u, %s, %d\r\n", TIM_TimeBaseStructure.TIM_Prescaler, __FUNCTION__, __LINE__);
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit(tim, &TIM_TimeBaseStructure);
}

void configTimeBaseMhz4UserBtn(TIM_TypeDef *tim, uint32_t period, uint8_t Mhz)
{
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	
	TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
//	printf("period: 0x%x, %s, %d\r\n", period, __FUNCTION__, __LINE__);
	TIM_TimeBaseStructure.TIM_Period = period;		// AKA TIMx_ARR
//	TIM_TimeBaseStructure.TIM_Period = (period - 1) & 0xFFFF;		// AKA TIMx_ARR
	
	TIM_TimeBaseStructure.TIM_Prescaler = (SystemCoreClock / timerClockDivisor(tim) / ((uint32_t)Mhz * 1000000)) - 1;
//	printf("TIM_Prescaler: %u, %s, %d\r\n", TIM_TimeBaseStructure.TIM_Prescaler, __FUNCTION__, __LINE__);
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit(tim, &TIM_TimeBaseStructure);
}

void timerOCInit(TIM_TypeDef *tim, uint8_t channel, TIM_OCInitTypeDef *init)
{
	switch (channel) {
		case TIM_Channel_1:
			TIM_OC1Init(tim, init);
			break;
		case TIM_Channel_2:
			TIM_OC2Init(tim, init);
			break;
		case TIM_Channel_3:
			TIM_OC3Init(tim, init);
			break;
		case TIM_Channel_4:
			TIM_OC4Init(tim, init);
			break;
	}
}

void timerOCPreloadConfig(TIM_TypeDef *tim, uint8_t channel, uint16_t preload)
{
	switch (channel) {
		case TIM_Channel_1:
			TIM_OC1PreloadConfig(tim, preload);
			break;
		case TIM_Channel_2:
			TIM_OC2PreloadConfig(tim, preload);
			break;
		case TIM_Channel_3:
			TIM_OC3PreloadConfig(tim, preload);
			break;
		case TIM_Channel_4:
			TIM_OC4PreloadConfig(tim, preload);
			break;
	}
}

volatile timCCR_t* timerChCCR(const timerHardware_t *timHw)
{
	return (volatile timCCR_t *)((volatile char *)&timHw->tim->CCR1 + timHw->channel);
}

void timerInit(void)
{
	memset(timerConfig, 0, sizeof(timerConfig));
	
	/* Enable the timer peripherals */
	for (int i = 0; i < USABLE_TIMER_CHANNEL_COUNT; i++) {
		RCC_ClockCmd(timerRCC(timerHardware[i].tim), ENABLE);
	}
	
#if defined(STM32F4)
	for (int timerIndex = 0; timerIndex < USABLE_TIMER_CHANNEL_COUNT; timerIndex++) {
		const timerHardware_t *timerHardwarePtr = &timerHardware[timerIndex];
		if (timerHardwarePtr->usageFlags == TIM_USE_PWM) {			// if timer uses PWM input capture mode, initialise to push-down configuration
//			printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//			printf("timerHardwarePtr->alternateFunction: %u, %s, %d\r\n", timerHardwarePtr->alternateFunction, __FUNCTION__, __LINE__);
			IOConfigGPIOAF(IOGetByTag(timerHardwarePtr->tag), IOCFG_AF_PP_PD, timerHardwarePtr->alternateFunction);
		}else {
			IOConfigGPIOAF(IOGetByTag(timerHardwarePtr->tag), IOCFG_AF_PP, timerHardwarePtr->alternateFunction);
		}
	}
#endif
	
	/* Initialise timer channel structures */
	for (int i = 0; i < USABLE_TIMER_CHANNEL_COUNT; i++) {
		timerChannelInfo[i].type = TYPE_FREE;
	}
	
	for (int i = 0; i < USED_TIMER_COUNT; i++) {
		timerInfo[i].priority = ~0;
	}
}

uint8_t timerInputIrq(TIM_TypeDef *tim)
{
	for (int i = 0; i < HARDWARE_TIMER_DEFINITION_COUNT; i++) {
		if (timerDefinitions[i].TIMx == tim) {
			return timerDefinitions[i].inputIrq;
		}
	}
	return 0;
}

void timerNVICConfigure(uint8_t irq)
{
	NVIC_InitTypeDef NVIC_InitStructure;
	
//	printf("irq: %u, %s, %d\r\n", irq, __FUNCTION__, __LINE__);		// irq (TIM5_IRQn) = 50
	NVIC_InitStructure.NVIC_IRQChannel = irq;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = NVIC_PRIORITY_BASE(NVIC_PRIO_TIMER);
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = NVIC_PRIORITY_SUB(NVIC_PRIO_TIMER);
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}

/* Old interface for PWM inputs. It should be replaced */
void timerConfigure(const timerHardware_t *timerHardwarePtr, uint16_t period, uint8_t mhz)
{
	/* Timer base configuration */
	configTimeBaseMhz(timerHardwarePtr->tim, period, mhz);
	TIM_Cmd(timerHardwarePtr->tim, ENABLE);				// Enable TIM5
	
	/* Timer NVIC IRQ configuration */
	uint8_t irq = timerInputIrq(timerHardwarePtr->tim);
	timerNVICConfigure(irq);
	
	/* HACK - enable second IRQ on timers that need it */
	switch (irq) {
		case TIM1_CC_IRQn:
			timerNVICConfigure(TIM1_UP_TIM10_IRQn);
			break;
		
		case TIM8_CC_IRQn:
			timerNVICConfigure(TIM8_UP_TIM13_IRQn);
			break;
	}
}

/* Old interface for PWM inputs. It should be replaced */
void timerConfigure4UserBtn(const timerHardware_t *timerHardwarePtr, uint32_t period, uint8_t mhz)
{
	/* Timer base configuration */
	configTimeBaseMhz4UserBtn(timerHardwarePtr->tim, period, mhz);
	TIM_Cmd(timerHardwarePtr->tim, ENABLE);				// Enable TIM5
	
	/* Timer NVIC IRQ configuration */
	uint8_t irq = timerInputIrq(timerHardwarePtr->tim);
	timerNVICConfigure(irq);

	/* HACK - enable second IRQ on timers that need it */
	switch (irq) {
		case TIM1_CC_IRQn:
			timerNVICConfigure(TIM1_UP_TIM10_IRQn);
			break;
		
		case TIM8_CC_IRQn:
			timerNVICConfigure(TIM8_UP_TIM13_IRQn);
			break;
	}
}

void timerChCCHandlerInit(timerCCHandlerRec_t *self, timerCCHandlerCallback *fn)
{
	self->fn = fn;
}

void timerChOvrHandlerInit(timerOvrHandlerRec_t *self, timerOvrHandlerCallback *fn)
{
	self->fn = fn;
	self->next = NULL;
}

/* Update overflow callback list
 * some synchronisation mechanism is neccesary to avoid disturbing other channels (BASEPRI used now)
 */
static void timerChConfig_UpdateOverflow(timerConfig_t *cfg, TIM_TypeDef *tim)
{
	timerOvrHandlerRec_t **chain = &cfg->overflowCallbackActive;
	
	/* It seems __cleanup__ doesn't get invoked in Keil IDE */
	//for (uint8_t __basepri_save __attribute__ ((__cleanup__(__basepriRestoreMem))) = __get_BASEPRI(), __ToDo = __basepriSetMemRetVal(NVIC_PRIO_TIMER); __ToDo ; __ToDo = 0) {
//	ATOMIC_BLOCK(NVIC_PRIO_TIMER) {
	for ( uint8_t __ToDo = __basepriSetMemRetVal(NVIC_PRIO_TIMER); __ToDo ; __ToDo = 0 ) {
		for (int i = 0; i < CC_CHANNELS_PER_TIMER; i++)
			if (cfg->overflowCallback[i]) {
				*chain = cfg->overflowCallback[i];
				chain = &cfg->overflowCallback[i]->next;
			}
		*chain = NULL;
		__set_BASEPRI(0x00);		// reset basepri to 0x00, no mask for interrupt
	}
	
