kyyang28/stm32f407disc_bldcmotor/src/quad/drivers/timer.c
	/* enable or disable IRQ */
//	printf("cfg->overflowCallbackActive: 0x%x, %s, %d\r\n", (uint32_t)cfg->overflowCallbackActive, __FUNCTION__, __LINE__);	// (uint32_t)cfg->overflowCallbackActive = 0x200017dc
	TIM_ITConfig(tim, TIM_IT_Update, cfg->overflowCallbackActive ? ENABLE : DISABLE);	// ENABLE TIM_IT_Update timer overflow interrupt here
}

/* config edge and overflow callback for channel. Try to avoid overflowCallback, it is a bit expensive */
void timerChConfigCallbacks(const timerHardware_t *timHw, timerCCHandlerRec_t *edgeCallback, timerOvrHandlerRec_t *overflowCallback)
{
	uint8_t timerIndex = lookupTimerIndex(timHw->tim);
//	printf("timHw->tim: 0x%x, %s, %d\r\n", (uint32_t)timHw->tim, __FUNCTION__, __LINE__);	// timHw->tim = 0x40000c00 (TIM5)
//	printf("timerIndex: %u, %s, %d\r\n", timerIndex, __FUNCTION__, __LINE__);				// timerIndex = 4
	if (timerIndex > USED_TIMER_COUNT) {
		return;
	}
	
//	printf("timHw->channel: %u, %s, %d\r\n", timHw->channel, __FUNCTION__, __LINE__);	// timHw->channel = 0 (TIM5 channel 1)
	uint8_t channelIndex = lookupChannelIndex(timHw->channel);
//	printf("channelIndex: %u, %s, %d\r\n", channelIndex, __FUNCTION__, __LINE__);
	
	if (edgeCallback == NULL) {		// disable irq before changing callback to NULL
		TIM_ITConfig(timHw->tim, TIM_IT_CCx(timHw->channel), DISABLE);
	}
	
	/* Setup callback info */
	timerConfig[timerIndex].edgeCallback[channelIndex] = edgeCallback;
	timerConfig[timerIndex].overflowCallback[channelIndex] = overflowCallback;
	
	/* Enable channel IRQ */
	if (edgeCallback) {
		TIM_ITConfig(timHw->tim, TIM_IT_CCx(timHw->channel), ENABLE);			// ENABLE TIM_IT_CC1 timer compare interrupt here
	}
	
	timerChConfig_UpdateOverflow(&timerConfig[timerIndex], timHw->tim);			// ENABLE TIM_IT_Update timer overflow interrupt in this function
}

/* Timer Input Capture Interrupt Service Routine (ISR) function */
static void timCCxHandler(TIM_TypeDef *tim, timerConfig_t *timerConfig)
{
	uint16_t capture;
//	unsigned tim_status_sr, tim_status_dier;
	unsigned tim_status;
//	tim_status_sr = tim->SR;
//	tim_status_dier = tim->DIER;
	tim_status = tim->SR & tim->DIER;
//	printf("sr: %u\r\n", tim_status_sr);
//	printf("dier: %u\r\n", tim_status_dier);
//	printf("tim_status: %u\r\n", tim_status);

#if 1
	while (tim_status) {
//		printf("%s, %d\r\n", __FUNCTION__, __LINE__);
		/* flags will be cleared by reading CCR in dual capture, make sure we call handler correctly
		 * current order is highest bit first. Code should not rely on specific order (it will introduce race conditions anyway)
		 */
		unsigned bit = __builtin_clz(tim_status);		// __builtin_clz returns the leading number of zero bits starting from MSB
		unsigned mask = ~(0x80000000 >> bit);
//		printf("bit: %u\r\n", bit);
//		printf("mask: %u\r\n", mask);
		tim->SR = mask;						// Clears the TIMx's interrupt pending bits
		tim_status &= mask;
		
		switch (bit) {
//			printf("%s, %d\r\n", __FUNCTION__, __LINE__);
#if 0
//			/* timer overflow handler */
//			case __builtin_clz(TIM_IT_Update): {	// __builtin_clz(TIM_IT_Update): 31
//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//				break;
//			}
//			
//			/* timer capture compare 1 handler */
//			case __builtin_clz(TIM_IT_CC1):			// __builtin_clz(TIM_IT_CC1): 30
//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//				timerConfig->edgeCallback[0]->fn(timerConfig->edgeCallback[0], tim->CCR1);
//				break;

//			/* timer capture compare 2 handler */
//			case __builtin_clz(TIM_IT_CC2):			// __builtin_clz(TIM_IT_CC2): 29
//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//				timerConfig->edgeCallback[1]->fn(timerConfig->edgeCallback[1], tim->CCR2);
//				break;

//			/* timer capture compare 3 handler */
//			case __builtin_clz(TIM_IT_CC3):			// __builtin_clz(TIM_IT_CC3): 28
//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//				timerConfig->edgeCallback[2]->fn(timerConfig->edgeCallback[2], tim->CCR3);
//				break;

//			/* timer capture compare 4 handler */
//			case __builtin_clz(TIM_IT_CC4):			// __builtin_clz(TIM_IT_CC4): 27
//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//				timerConfig->edgeCallback[3]->fn(timerConfig->edgeCallback[3], tim->CCR4);
//				break;
#else
			/* timer overflow handler */
			case 31: {	// __builtin_clz(TIM_IT_Update) = 31
//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//				printf("timerConfig->forcedOverflowTimerValue: %u, %s, %d\r\n", timerConfig->forcedOverflowTimerValue, __FUNCTION__, __LINE__);
				if (timerConfig->forcedOverflowTimerValue != 0) {			// forcedOverflowTimerValue used in pwm_output.c oneshot125 motor protocol
					capture = timerConfig->forcedOverflowTimerValue - 1;
					timerConfig->forcedOverflowTimerValue = 0;
				}else {
					capture = tim->ARR;
//					printf("capture: %u, %s, %d\r\n", capture, __FUNCTION__, __LINE__);
				}
				
				timerOvrHandlerRec_t *cb = timerConfig->overflowCallbackActive;
				while (cb) {
					cb->fn(cb, capture);		// call pwmOverflowCallback() function in rx_pwm.c
					cb = cb->next;
				}
				break;
			}
			
			/* timer capture compare 1 handler */
			case 30:			// __builtin_clz(TIM_IT_CC1) = 30
//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
				timerConfig->edgeCallback[0]->fn(timerConfig->edgeCallback[0], tim->CCR1);		// call pwmEdgeCallback() function in rx_pwm.c
				break;

			/* timer capture compare 2 handler */
			case 29:			// __builtin_clz(TIM_IT_CC2) = 29
//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
				timerConfig->edgeCallback[1]->fn(timerConfig->edgeCallback[1], tim->CCR2);
				break;

			/* timer capture compare 3 handler */
			case 28:			// __builtin_clz(TIM_IT_CC3) = 28
//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
				timerConfig->edgeCallback[2]->fn(timerConfig->edgeCallback[2], tim->CCR3);
				break;

			/* timer capture compare 4 handler */
			case 27:			// __builtin_clz(TIM_IT_CC4) = 27
//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
				timerConfig->edgeCallback[3]->fn(timerConfig->edgeCallback[3], tim->CCR4);
				break;
#endif
		}	// end switch
	}
#endif
}

