kyyang28/stm32f407disc_bldcmotor/src/quad/drivers/timer.c
/* Handler for shared interrupts when both timers need to check status bits
 * TIMER_INDEX(1) = 0
 * TIMER_INDEX(2) = 1
 * TIMER_INDEX(3) = 2
 * TIMER_INDEX(4) = 3
 * TIMER_INDEX(5) = 4
 */
#define _TIM_IRQ_HANDLER(name, i)									\
	void name(void)													\
	{																\
		timCCxHandler(TIM ## i, &timerConfig[TIMER_INDEX(i)]);		\
	} struct dummy

#if USED_TIMERS & TIM_N(1)
_TIM_IRQ_HANDLER(TIM1_CC_IRQHandler, 1);
#endif

#if USED_TIMERS & TIM_N(2)
_TIM_IRQ_HANDLER(TIM2_IRQHandler, 2);
#endif

#if USED_TIMERS & TIM_N(3)
_TIM_IRQ_HANDLER(TIM3_IRQHandler, 3);
#endif

#if USED_TIMERS & TIM_N(4)
_TIM_IRQ_HANDLER(TIM4_IRQHandler, 4);
#endif

#if 1
#if USED_TIMERS & TIM_N(5)
_TIM_IRQ_HANDLER(TIM5_IRQHandler, 5);
#endif
#else
/* TIM5 Interrupt Service Routine */
//void TIM5_IRQHandler(void)
//{
//	if ((TIM5_CH1_CAPTURE_STATUS & 0x80) == 0) {					// capture unsuccessful
//		if (TIM_GetITStatus(TIM5, TIM_IT_Update) != RESET) {		// overflow occurs
//			if (TIM5_CH1_CAPTURE_STATUS & 0x40) {					// high level voltage is captured
//				if ((TIM5_CH1_CAPTURE_STATUS & 0x3F) == 0x3F) {		// high level voltage is too long
//					TIM5_CH1_CAPTURE_STATUS |= 0x80;				// mark capture
//					TIM5_CH1_CAPTURE_VAL = 0xFFFFFFFF;
//				}else {
//					TIM5_CH1_CAPTURE_STATUS++;
//				}
//			}
//		}
//		
//		if (TIM_GetITStatus(TIM5, TIM_IT_CC1) != RESET) {			// capture event occurs
//			if (TIM5_CH1_CAPTURE_STATUS & 0x40) {					// falling-edge is captured	(0x40: 1 << 6)
//				TIM5_CH1_CAPTURE_STATUS |= 0x80;					// high level voltage is captured
//				TIM5_CH1_CAPTURE_VAL = TIM_GetCapture1(TIM5);		// Obtain the current capture value from CCR1 register
//				TIM_OC1PolarityConfig(TIM5, TIM_ICPolarity_Rising);	// CC1P = 0, setup rising-edge capture mode
//			}else {
//				TIM5_CH1_CAPTURE_STATUS = 0;						// clear capture status
//				TIM5_CH1_CAPTURE_VAL = 0;							// clear capture value
//				TIM5_CH1_CAPTURE_STATUS |= 0x40;					// mark rising-edge is captured
//				TIM_Cmd(TIM5, DISABLE);								// disable timer5
//				TIM_SetCounter(TIM5, 0);							// set CNT register of time5 to 0
//				TIM_OC1PolarityConfig(TIM5, TIM_ICPolarity_Falling);// CC1P = 1, setup to falling-edge capture
//				TIM_Cmd(TIM5, ENABLE);								// enable timer5
//			}
//		}
//	}
//	
//	TIM_ClearITPendingBit(TIM5, TIM_IT_CC1 | TIM_IT_Update);
//}
#endif

#if 0
//static void timCCxHandler(TIM_TypeDef *tim, timerConfig_t *timerConfig)
//{
//	uint16_t capture;
////	unsigned tim_status_sr, tim_status_dier;
//	unsigned tim_status;
////	tim_status_sr = tim->SR;
////	tim_status_dier = tim->DIER;
//	tim_status = tim->SR & tim->DIER;
////	printf("sr: %u\r\n", tim_status_sr);
////	printf("dier: %u\r\n", tim_status_dier);
////	printf("tim_status: %u\r\n", tim_status);

//#if 1
//	while (tim_status) {
////		printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//		/* flags will be cleared by reading CCR in dual capture, make sure we call handler correctly
//		 * current order is highest bit first. Code should not rely on specific order (it will introduce race conditions anyway)
//		 */
//		unsigned bit = __builtin_clz(tim_status);
//		unsigned mask = ~(0x80000000 >> bit);
////		printf("bit: %u\r\n", bit);
////		printf("mask: %u\r\n", mask);
//		tim->SR = mask;						// Clears the TIMx's interrupt pending bits
//		tim_status &= mask;
//		
//		if ((TIM5_CH1_CAPTURE_STATUS & 0x80) == 0) {
//			switch (bit) {
//	//			printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//	#if 0
//	//			/* timer overflow handler */
//	//			case __builtin_clz(TIM_IT_Update): {	// __builtin_clz(TIM_IT_Update): 31
//	//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//	//				break;
//	//			}
//	//			
//	//			/* timer capture compare 1 handler */
//	//			case __builtin_clz(TIM_IT_CC1):			// __builtin_clz(TIM_IT_CC1): 30
//	//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//	//				timerConfig->edgeCallback[0]->fn(timerConfig->edgeCallback[0], tim->CCR1);
//	//				break;

//	//			/* timer capture compare 2 handler */
//	//			case __builtin_clz(TIM_IT_CC2):			// __builtin_clz(TIM_IT_CC2): 29
//	//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//	//				timerConfig->edgeCallback[1]->fn(timerConfig->edgeCallback[1], tim->CCR2);
//	//				break;

//	//			/* timer capture compare 3 handler */
//	//			case __builtin_clz(TIM_IT_CC3):			// __builtin_clz(TIM_IT_CC3): 28
//	//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//	//				timerConfig->edgeCallback[2]->fn(timerConfig->edgeCallback[2], tim->CCR3);
//	//				break;

//	//			/* timer capture compare 4 handler */
//	//			case __builtin_clz(TIM_IT_CC4):			// __builtin_clz(TIM_IT_CC4): 27
//	//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//	//				timerConfig->edgeCallback[3]->fn(timerConfig->edgeCallback[3], tim->CCR4);
//	//				break;
//	#else
//				/* timer overflow handler */
//				case 31: {	// __builtin_clz(TIM_IT_Update) = 31
//	//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//	//				printf("timerConfig->forcedOverflowTimerValue: %u, %s, %d\r\n", timerConfig->forcedOverflowTimerValue, __FUNCTION__, __LINE__);
//					if (timerConfig->forcedOverflowTimerValue != 0) {			// forcedOverflowTimerValue used in pwm_output.c oneshot125 motor protocol
//						capture = timerConfig->forcedOverflowTimerValue - 1;
//						timerConfig->forcedOverflowTimerValue = 0;
//					}else {
//						capture = tim->ARR;
//	//					printf("capture: %u, %s, %d\r\n", capture, __FUNCTION__, __LINE__);
//					}
//					
//					timerOvrHandlerRec_t *cb = timerConfig->overflowCallbackActive;
//					while (cb) {
//						cb->fn(cb, capture);		// call pwmOverflowCallback() function in rx_pwm.c
//						cb = cb->next;
//					}
//					break;
//				}
//				
//				/* timer capture compare 1 handler */
//				case 30:			// __builtin_clz(TIM_IT_CC1) = 30
//	//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//					timerConfig->edgeCallback[0]->fn(timerConfig->edgeCallback[0], tim->CCR1);		// call pwmEdgeCallback() function in rx_pwm.c
//					break;

//				/* timer capture compare 2 handler */
//				case 29:			// __builtin_clz(TIM_IT_CC2) = 29
//	//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//					timerConfig->edgeCallback[1]->fn(timerConfig->edgeCallback[1], tim->CCR2);
//					break;

//				/* timer capture compare 3 handler */
//				case 28:			// __builtin_clz(TIM_IT_CC3) = 28
//	//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//					timerConfig->edgeCallback[2]->fn(timerConfig->edgeCallback[2], tim->CCR3);
//					break;

//				/* timer capture compare 4 handler */
//				case 27:			// __builtin_clz(TIM_IT_CC4) = 27
//	//				printf("%s, %d\r\n", __FUNCTION__, __LINE__);
//					timerConfig->edgeCallback[3]->fn(timerConfig->edgeCallback[3], tim->CCR4);
//					break;
//	#endif
//			}	// end switch
//		}	// end if ((TIM5_CH1_CAPTURE_STATUS & 0x80) == 0)
//	}
//#endif
//}
#endif
